# İndexleme - Seçme - Filtreleme

In [22]:
import pandas as pd
import numpy as np

## Series ile çalışma

In [23]:
obj = pd.Series(np.arange(5), index=["a","b","c","d","e"])

In [24]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [25]:
obj["c"]

2

In [26]:
obj[2]

2

In [27]:
obj[:3]

a    0
b    1
c    2
dtype: int32

In [28]:
obj[["a","c"]]

a    0
c    2
dtype: int32

In [29]:
obj[[0,2]]

a    0
c    2
dtype: int32

In [30]:
obj[obj<2]

a    0
b    1
dtype: int32

In [31]:
obj["a":"d"]

a    0
b    1
c    2
d    3
dtype: int32

In [34]:
obj["b":"d"] = 5
obj

a    0
b    5
c    5
d    5
e    4
dtype: int32

## Pandas'da -1 indeklemesi için indekslerin etiketli olması gerekir

In [62]:
obj = pd.Series(np.arange(5), index=["a","b","c","d","e"])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [64]:
obj[-1]

4

## DataFrame ile çalışma

In [35]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index=["Bursa","Ankara","Rize","İstanbul"],
                   columns=["Bir","İki","Üç","Dört"])
data

          Bir  İki  Üç  Dört
Bursa       0    1   2     3
Ankara      4    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [36]:
data["İki"]

Bursa        1
Ankara       5
Rize         9
İstanbul    13
Name: İki, dtype: int32

In [21]:
data[["İki","Dört"]]

          İki  Dört
Bursa       1     3
Ankara      5     7
Rize        9    11
İstanbul   13    15

In [49]:
data[:2]

        Bir  İki  Üç  Dört
Bursa     0    0   0     0
Ankara    0    5   6     7

In [50]:
data[data["Dört"]>5]

          Bir  İki  Üç  Dört
Ankara      0    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [51]:
data[data<5] = 0
data

          Bir  İki  Üç  Dört
Bursa       0    0   0     0
Ankara      0    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

## DataFrame'de iloc, loc komutları

In [53]:
data.iloc[1]

Bir     0
İki     5
Üç      6
Dört    7
Name: Ankara, dtype: int32

In [44]:
data.iloc[1,[1,2]]

İki    5
Üç     6
Name: Ankara, dtype: int32

In [45]:
data.iloc[[0,3],[0,2]]

          Bir  Üç
Bursa       0   0
İstanbul   12  14

In [46]:
data.loc["Ankara",["İki","Dört"]]

İki     5
Dört    7
Name: Ankara, dtype: int32

In [47]:
data.loc[:"Rize","Bir"]

Bursa     0
Ankara    0
Rize      8
Name: Bir, dtype: int32

In [48]:
data.loc[:"Rize",["Bir","Üç","Dört"]]

        Bir  Üç  Dört
Bursa     0   0     0
Ankara    0   6     7
Rize      8  10    11